name: "test"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 128
input_dim: 64

layer {
    type: "Convolution"
    bottom: "map/TensorArrayStack/TensorArrayGatherV3"
    top: "conv1_1/Elu"
    name: "conv1_1/Elu"
}
layer {
    type: "Convolution"
    bottom: "conv1_1/Elu"
    top: "conv1_2/Elu"
    name: "conv1_2/Elu"
}
layer {
    type: "MaxPool2d"
    bottom: "conv1_2/Elu"
    top: "pool1/MaxPool"
    name: "pool1/MaxPool"
}
layer {
    type: "Convolution"
    bottom: "pool1/MaxPool"
    top: "conv2_1/1/Elu"
    name: "conv2_1/1/Elu"
}
layer {
    type: "Dropout"
    bottom: "conv2_1/1/Elu"
    top: "Dropout/Identity"
    name: "Dropout/Identity"
}
layer {
    type: "Convolution"
    bottom: "Dropout/Identity"
    top: "conv2_1/2/BiasAdd"
    name: "conv2_1/2/BiasAdd"
}
layer {
    type: "Eltwise"
    bottom: "pool1/MaxPool"
    bottom: "conv2_1/2/BiasAdd"
    top: "add"
    name: "add"
}
# 7
layer {
    type: "BatchNorm"
    bottom: "add"
    top: "conv2_3/bn/batchnorm/add_1"
    name: "conv2_3/bn/batchnorm/add_1"
}
layer {
    type: "ELU"
    bottom: "conv2_3/bn/batchnorm/add_1"
    top: "Elu"
    name: "Elu"
}
layer {
    type: "Convolution"
    bottom: "Elu"
    top: "conv2_3/1/Elu"
    name: "conv2_3/1/Elu"
}
# 10
layer {
    type: "Dropout"
    bottom: "conv2_3/1/Elu"
    top: "Dropout_1/Identity"
    name: "Dropout_1/Identity"
}
layer {
    type: "Convolution"
    bottom: "Dropout_1/Identity"
    top: "conv2_3/2/BiasAdd"
    name: "conv2_3/2/BiasAdd"
}
layer {
    type: "Eltwise"
    bottom: "add"
    bottom: "conv2_3/2/BiasAdd"
    top: "add_1"
    name: "add_1"
}
layer {
    type: "BatchNorm"
    bottom: "add_1"
    top: "conv3_1/bn/batchnorm/add_1"
    name: "conv3_1/bn/batchnorm/add_1"
}
layer {
    type: "ELU"
    bottom: "conv3_1/bn/batchnorm/add_1"
    top: "Elu_1"
    name: "Elu_1"
}
# 15
layer {
    type: "Convolution"
    bottom: "Elu_1"
    top: "conv3_1/1/Elu"
    name: "conv3_1/1/Elu"
}
layer {
    type: "Dropout"
    bottom: "conv3_1/1/Elu"
    top: "Dropout_2/Identity"
    name: "Dropout_2/Identity"
}
layer {
    type: "Convolution"
    bottom: "Dropout_2/Identity"
    top: "conv3_1/2/BiasAdd"
    name: "conv3_1/2/BiasAdd"
}
#18
layer {
    type: "Convolution"
    bottom: "add_1"
    top: "conv3_1/projection/convolution"
    name: "conv3_1/projection/convolution"
}
layer {
    type: "Eltwise"
    bottom: "conv3_1/projection/convolution"
    bottom: "conv3_1/2/BiasAdd"
    top: "add_2"
    name: "add_2"
}
layer {
    type: "BatchNorm"
    bottom: "add_2"
    top: "conv3_3/bn/batchnorm/add_1"
    name: "conv3_3/bn/batchnorm/add_1"
}
layer {
    type: "ELU"
    bottom: "conv3_3/bn/batchnorm/add_1"
    top: "Elu_2"
    name: "Elu_2"
}
layer {
    type: "Convolution"
    bottom: "Elu_2"
    top: "conv3_3/1/Elu"
    name: "conv3_3/1/Elu"
}
layer {
    type: "Dropout"
    bottom: "conv3_3/1/Elu"
    top: "Dropout_3/Identity"
    name: "Dropout_3/Identity"
}
layer {
    type: "Convolution"
    bottom: "Dropout_3/Identity"
    top: "conv3_3/2/BiasAdd"
    name: "conv3_3/2/BiasAdd"
}
layer {
    type: "Eltwise"
    bottom: "add_2"
    bottom: "conv3_3/2/BiasAdd"
    top: "add_3"
    name: "add_3"
}
layer {
    type: "BatchNorm"
    bottom: "add_3"
    top: "conv4_1/bn/batchnorm/add_1"
    name: "conv4_1/bn/batchnorm/add_1"
}
layer {
    type: "ELU"
    bottom: "conv4_1/bn/batchnorm/add_1"
    top: "Elu_3"
    name: "Elu_3"
}
layer {
    type: "Convolution"
    bottom: "Elu_3"
    top: "conv4_1/1/Elu"
    name: "conv4_1/1/Elu"
}
layer {
    type: "Dropout"
    bottom: "conv4_1/1/Elu"
    top: "Dropout_4/Identity"
    name: "Dropout_4/Identity"
}
layer {
    type: "Convolution"
    bottom: "Dropout_4/Identity"
    top: "conv4_1/2/BiasAdd"
    name: "conv4_1/2/BiasAdd"
}
layer {
    type: "Convolution"
    bottom: "add_3"
    top: "conv4_1/projection/convolution"
    name: "conv4_1/projection/convolution"
}
layer {
    type: "Eltwise"
    bottom: "conv4_1/projection/convolution"
    bottom: "conv4_1/2/BiasAdd"
    top: "add_4"
    name: "add_4"
}
layer {
    type: "BatchNorm"
    bottom: "add_4"
    top: "conv4_3/bn/batchnorm/add_1"
    name: "conv4_3/bn/batchnorm/add_1"
}
layer {
    type: "ELU"
    bottom: "conv4_3/bn/batchnorm/add_1"
    top: "Elu_4"
    name: "Elu_4"
}
layer {
    type: "Convolution"
    bottom: "Elu_4"
    top: "conv4_3/1/Elu"
    name: "conv4_3/1/Elu"
}
layer {
    type: "Dropout"
    bottom: "conv4_3/1/Elu"
    top: "Dropout_5/Identity"
    name: "Dropout_5/Identity"
}
layer {
    type: "Convolution"
    bottom: "Dropout_5/Identity"
    top: "conv4_3/2/BiasAdd"
    name: "conv4_3/2/BiasAdd"
}
layer {
    type: "Eltwise"
    bottom: "add_4"
    bottom: "conv4_3/2/BiasAdd"
    top: "add_5"
    name: "add_5"
}
layer {
    type: "Flatten"
    bottom: "add_5"
    top: "Flatten/Reshape"
    name: "Flatten/Reshape"
}
layer {
    type: "Dropout"
    bottom: "Flatten/Reshape"
    top: "Dropout_6/Identity"
    name: "Dropout_6/Identity"
}
layer {
    type: "InnerProduct"
    bottom: "fc1/Elu"
    top: "fc1/Elu"
    name: "fc1/Elu"
}
